ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263X/ESM_ESM_52D00000h.xml
<module name="ESM" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="ESM_PID" acronym="ESM_PID" offset="0" width="32" description="The Revision Register contains the major and minor revisions for the module.">
		<bitfield id="SCHEME" width="2" begin="31" end="30" resetval="0x1" description="PID register scheme" range="31:30" rwaccess="R"/>
	<bitfield id="BU" width="2" begin="29" end="28" resetval="0x2" description="Business Unit: 10 = Processors" range="29:28" rwaccess="R"/>
	<bitfield id="FUNC" width="12" begin="27" end="16" resetval="0x4064" description="Module ID" range="27:16" rwaccess="R"/>
	<bitfield id="RTL" width="5" begin="15" end="11" resetval="0x9" description="RTL revision. Will vary depending on release." range="15:11" rwaccess="R"/>
	<bitfield id="MAJOR" width="3" begin="10" end="8" resetval="0x1" description="Major revision" range="10:8" rwaccess="R"/>
	<bitfield id="CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Custom" range="7:6" rwaccess="R"/>
	<bitfield id="MINOR" width="6" begin="5" end="0" resetval="0x0" description="Minor revision" range="5:0" rwaccess="R"/>
	</register><register id="ESM_INFO" acronym="ESM_INFO" offset="4" width="32" description="The Info Register gives the configuration Inforrmation of this ESM.">
		<bitfield id="LAST_RESET" width="1" begin="31" end="31" resetval="0x0" description="Indicates the Source of the last Reset 1'b0 : Last reset was a Power On Reset 1'b1 : Last reset was a Warm Reset" range="31" rwaccess="R"/>
	<bitfield id="PULSE_GROUPS" width="8" begin="15" end="8" resetval="0x1" description="Number of Pulse Error Groups" range="15:8" rwaccess="R"/>
	<bitfield id="GROUPS" width="8" begin="7" end="0" resetval="0x3" description="Total number of Error Groups" range="7:0" rwaccess="R"/>
	</register><register id="ESM_EN" acronym="ESM_EN" offset="8" width="32" description="The Global Enable Register has the master interrupt mask.">
		<bitfield id="KEY" width="4" begin="3" end="0" resetval="0x0" description="This field is a global mask to all interrupts.  It is reset by the warm reset.  The purpose is to leave all of the raw status and per-interrupt enable bits alone so that, after a warm reset, software may observe the state of the ESM before the warm reset and try to debug what may have caused the reset. 4'b0000: All events are disabled 4'b1111: All events are enabled  All others are invalid" range="3:0" rwaccess="R/W"/>
	</register><register id="ESM_SFT_RST" acronym="ESM_SFT_RST" offset="12" width="32" description="The Global Soft Reset Register controls the global clear for raw status and enables.">
		<bitfield id="KEY" width="4" begin="3" end="0" resetval="0x0" description="Writing to this field can cause all of the raw status and all enables to be cleared.  This can be used to reset the ESM state after debugging because of a warm reset. Write:  4'b1111: Clear all raw status and enable bits  All others no effect Read: Always read as 4'b0000" range="3:0" rwaccess="W"/>
	</register><register id="ESM_ERR_RAW" acronym="ESM_ERR_RAW" offset="16" width="32" description="Raw Status/Set Register for Configuration Errors.">
		<bitfield id="STS" width="3" begin="2" end="0" resetval="0x0" description="This is the raw status for errors in the configuration for Group N. This field is only reset by a Power-On-Reset and not by warm reset. A global soft reset will set this field to 0 Read: 1'b0:Inactive 1'b1:Active/Pending Write 1'b1 to set event raw status Bits associated with groups that are not implemented in a certain configuration are Reserved, Read as 0 and writes will have no effect." range="2:0" rwaccess="R/W1TS"/>
	</register><register id="ESM_ERR_STS" acronym="ESM_ERR_STS" offset="20" width="32" description="Config Error Enable and Clear Register.">
		<bitfield id="MSK" width="3" begin="2" end="0" resetval="0x0" description="This is the masked status for errors in the configuration for Group N.  This field is only reset by a Power-On-Reset (not warm reset).  A global soft reset will set this field to 0. Read: 1'b0:Inactive 1'b1:Active/Pending and Enabled Write 1'b1 to clear event raw status. Bits associated with groups that are not implemented in a certain configuration are Reserved, Read as 0 and writes will have no effect" range="2:0" rwaccess="R/W1TC"/>
	</register><register id="ESM_ERR_EN_SET" acronym="ESM_ERR_EN_SET" offset="24" width="32" description="Config Error Enable Set Register.">
		<bitfield id="MSK" width="3" begin="2" end="0" resetval="0x0" description="This is the mask enable for errors in the configuration for Group N.  If the corresponding bit and the global_enable are set, then then interrupt is unmasked.  This field is only reset by a Power-On-Reset (not warm reset).  A global soft reset will set this field to 0. Read: 1'b0:Disabled 1'b1:Enabled Write 1'b1 to set enable Bits associated with groups that are not implemented in a certain configuration are Reserved, Read as 0 and writes will have no effect." range="2:0" rwaccess="R/W1TS"/>
	</register><register id="ESM_ERR_EN_CLR" acronym="ESM_ERR_EN_CLR" offset="28" width="32" description="Config Error Interrupt Enabled Clear register.">
		<bitfield id="MSK" width="3" begin="2" end="0" resetval="0x0" description="This is the mask clear for errors in the configuration for Group N. If the corresponding bit and the global_enable are set, then then interrupt is unmasked.  This field is only reset by a Power-On-Reset (not warm reset).  A global soft reset will set this field to 0. Read: 1'b0:Disabled 1'b1:Enabled Write 1'b1 to clear enable Bits associated with groups that are not implemented in a certain configuration are Reserved, Read as 0 and writes will have no effect." range="2:0" rwaccess="R/W1TC"/>
	</register><register id="ESM_LOW_PRI" acronym="ESM_LOW_PRI" offset="32" width="32" description="Shows which is the highest priority outstanding low priority interrupt.">
		<bitfield id="PLS" width="16" begin="31" end="16" resetval="0x65535" description="Indicates what the highest priority Low Priority interrupt caused by a pulse number is.  The lowest event has the highest priority.  i.e. if Global Events 0, 1, 2, 3, and 4 are pending, and Global Event 0, and 1 are configured for High Priority while Global Events 2, 3, and 4 are configured for Low Priority, then the value of this field will be 0x2.  A value of all ones (0xFFFF) indicates that there are no low priority interrupts pending.  This field is updated whenever a new, higher priority event comes in.  Software cannot read this field multiple times during an interrupt service routine to keep track of which interrupt is being serviced, because this field may have been updated with a higher priority event." range="31:16" rwaccess="R"/>
	<bitfield id="LVL" width="16" begin="15" end="0" resetval="0x65535" description="Indicates what the highest priority Low Priority interrupt caused by a level number is.  The lowest event has the highest priority.  i.e. if Global Events 0, 1, 2, 3, and 4 are pending, and Global Event 0, and 1 are configured for High Priority while Global Events 2, 3, and 4 are configured for Low Priority, then the value of this field will be 0x2.  A value of all ones (0xFFFF) indicates that there are no low priority interrupts pending.  This field is updated whenever a new, higher priority event comes in.  Software cannot read this field multiple times during an interrupt service routine to keep track of which interrupt is being serviced, because this field may have been updated with a higher priority event." range="15:0" rwaccess="R"/>
	</register><register id="ESM_HI_PRI" acronym="ESM_HI_PRI" offset="36" width="32" description="Shows which is the highest priority outstanding high priority interrupt.">
		<bitfield id="PLS" width="16" begin="31" end="16" resetval="0x65535" description="Indicates what the highest priority High Priority interrupt caused by a pulse number is.  The lowest event has the highest priority.  i.e. if Global Events 0, 1, 2, 3, and 4 are pending, and Global Event 0, and 1 are configured for High Priority while Global Events 2, 3, and 4 are configured for Low Priority, then the value of this field will be 0x0.  A value of all ones (0xFFFF) indicates that there are no high priority interrupts pending.  This field is updated whenever a new, higher priority event comes in.  Software cannot read this field multiple times during an interrupt service routine to keep track of which interrupt is being serviced, because this field may have been updated with a higher priority event." range="31:16" rwaccess="R"/>
	<bitfield id="LVL" width="16" begin="15" end="0" resetval="0x65535" description="Indicates what the highest priority Low Priority interrupt caused by a level number is.  The lowest event has the highest priority.  i.e. if Global Events 0, 1, 2, 3, and 4 are pending, and Global Event 0, and 1 are configured for High Priority while Global Events 2, 3, and 4 are configured for Low Priority, then the value of this field will be 0x0.  A value of all ones (0xFFFF) indicates that there are no high priority interrupts pending.  This field is updated whenever a new, higher priority event comes in.  Software cannot read this field multiple times during an interrupt service routine to keep track of which interrupt is being serviced, because this field may have been updated with a higher priority event." range="15:0" rwaccess="R"/>
	</register><register id="ESM_LOW" acronym="ESM_LOW" offset="40" width="32" description="Shows which groups have oustanding low priority interrupts.">
		<bitfield id="STS" width="32" begin="31" end="0" resetval="0x0" description="Indicates which Event Groups have one or more Low Priority interrupts pending.  This register is bit oriented where bit 0 is for Event Group 0, bit 1 is for Event Group 1, etc (bit N is for Event Group N)" range="31:0" rwaccess="R"/>
	</register><register id="ESM_HI" acronym="ESM_HI" offset="44" width="32" description="Shows which groups have oustanding high priority interrupts.">
		<bitfield id="STS" width="32" begin="31" end="0" resetval="0x0" description="Indicates which Event Groups have one or more High Priority interrupts pending.  This register is bit oriented where bit 0 is for Event Group 0, bit 1 is for Event Group 1, etc (bit N is for Event Group N)" range="31:0" rwaccess="R"/>
	</register><register id="ESM_EOI" acronym="ESM_EOI" offset="48" width="32" description="End of Interrupt Register.">
		<bitfield id="KEY" width="11" begin="10" end="0" resetval="0x0" description="Writing the corresponding vector to this field will cause a re-evaluation of interrupts.  If, when the vector is written, there are still pending interrupts, a new pulse will be generated. 0 : Configuration Error Interrupt 1 : Low Priority Error Interrupt 2 : High Priority Error Interrupt 32047:Reserved (writes have no effect)" range="10:0" rwaccess="W"/>
	</register><register id="ESM_PIN_CTRL" acronym="ESM_PIN_CTRL" offset="64" width="32" description="This register controls the error_pin_n output.">
		<bitfield id="PWM_EN" width="4" begin="7" end="4" resetval="0x0" description="PWM mode enable. This field should only be modified when the ESM is disabled, from the Global Enable register. This field is only reset by a Power-On-Reset (not warm reset). 4'b0000:Error output pin is a level 4'b1111:Error output pin is a PWM signal All other are invalid" range="7:4" rwaccess="R/W"/>
	<bitfield id="KEY" width="4" begin="3" end="0" resetval="0x0" description="This field controls behavior of the Error Pin.  Note, during reset the field is 4'b0000, but the Error Pin is asserted (active low).  Immediately after reset, the Error Pin de-asserts.  This field is only reset by a Power-On-Reset (not warm reset). 4'b0000 : Normal Mode - Error Pin will activate when an enabled Error Event occurs 4'b1010 : Force Error Mode - Forces the Error Pin active.  To clear the Error Pin (return to the ESM_IDLE state) write this field back to Normal Mode (Writing a CLEAR event will also work). You may only write to Force Error Mode while in IDLE.  Attempting Force Error while in another state will have no effect 4'b0101 : CLEAR Event - generates a CLEAR event to the ESM state machine.  key will return to Normal Mode (4'b0000) on the next cycle. All Other Values - Normal Mode.  Writing any of these values will have no effect.  Reading any of these values indicate that one or more bits have experienced a single event upset and software should write the field back to 4'b0000.  The ESM will continue to operate in Normal Mode" range="3:0" rwaccess="R/W"/>
	</register><register id="ESM_PIN_STS" acronym="ESM_PIN_STS" offset="68" width="32" description="This register reflects the status of the error_pin_n output.">
		<bitfield id="VAL" width="1" begin="0" end="0" resetval="0x0" description="This field indicates the status of the Error Pin as looped back from the I/O. This field reflects the state of SAFETY_ERRORn I/O. 1'b1 - De-Asserted 1'b0 - Asserted Note, while in reset the error pin is actually active (asserted low), but goes inactive immediately after the de-assertion of Power-on-Reset.  Hence, the value that will be read after Power-on-Reset is 1, but may be 0 after a warm reset." range="0" rwaccess="R"/>
	</register><register id="ESM_PIN_CNTR" acronym="ESM_PIN_CNTR" offset="72" width="32" description="This register shows the current value of the error pin counter.">
		<bitfield id="COUNT" width="24" begin="23" end="0" resetval="0x200000" description="This field indicates the current value of the Time Interval Counter. Register is reloaded to the counter preload value on entry to the ESM_ERROR state from ESM_IDLE and counts down by one per clock cycle.  Once the counter has reached 0, the Minimum Time Interval has expired. This field is only reset by a Power-On-Reset (not warm reset)." range="23:0" rwaccess="R"/>
	</register><register id="ESM_PIN_CNTR_PRE" acronym="ESM_PIN_CNTR_PRE" offset="76" width="32" description="This register contains the value that is loaded in to the Error Counter.">
		<bitfield id="COUNT" width="24" begin="23" end="0" resetval="0x200000" description="This is the value that will be loaded in to the counter field of the Error Pin Counter Value Register whenever the ESM enters the ESM_ERROR state from ESM_IDLE. This field is only reset by a Power-On-Reset (not warm reset)." range="23:0" rwaccess="R/W"/>
	</register><register id="ESM_PWMH_PIN_CNTR" acronym="ESM_PWMH_PIN_CNTR" offset="80" width="32" description="This register shows the current value of the error pin PWM high counter.">
		<bitfield id="COUNT" width="24" begin="23" end="0" resetval="0x100000" description="This field indicates the current value of the PWM High Time Interval Counter.The reset value is the 24'h0186A0.  If pwm_en is set to PWM mode, then this register is enabled. This register is reloaded to the PWM high PIN_CNTR_PRE.count value when the error output pin toggles high.  It will decrement by 1 each cycle when the error output pin is high. Once the counter has reached 0, the error output pin will toggle low. This field is only reset by a Power-On-Reset (not warm reset).  A global soft reset will set this field to 24'h0186A0" range="23:0" rwaccess="R"/>
	</register><register id="ESM_PWMH_PIN_CNTR_PRE" acronym="ESM_PWMH_PIN_CNTR_PRE" offset="84" width="32" description="This register contains the value that is loaded in to the Error PWM High Counter.">
		<bitfield id="COUNT" width="24" begin="23" end="0" resetval="0x100000" description="This is the value that will be loaded in to the counter field of the Error Pin PWM High Counter Value Register whenever the error output pin toggles high. This field is only reset by a Power-On-Reset (not warm reset).  A global soft reset will set this field to 24'h0186A0." range="23:0" rwaccess="R/W"/>
	</register><register id="ESM_PWML_PIN_CNTR" acronym="ESM_PWML_PIN_CNTR" offset="88" width="32" description="This register shows the current value of the error pin PWM low counter.">
		<bitfield id="COUNT" width="24" begin="23" end="0" resetval="0x100000" description="This field indicates the current value of the PWM Low Time Interval Counter. The reset value is the 24'h0186A0.  If pwm_en is set to PWM mode, then this register is enabled. This register is reloaded to the PWM low counter_preload value when the error output pin toggles low.  It will decrement by 1 each cycle when the error output pin is low. Once the counter has reached 0, the error output pin will toggle high. This field is only reset by a Power-On-Reset (not warm reset).  A global soft reset will set this field to 24'h0186A0." range="23:0" rwaccess="R"/>
	</register><register id="ESM_PWML_PIN_CNTR_PRE" acronym="ESM_PWML_PIN_CNTR_PRE" offset="92" width="32" description="This register contains the value that is loaded in to the Error PWM Low Counter.">
		<bitfield id="COUNT" width="24" begin="23" end="0" resetval="0x100000" description="This is the value that will be loaded in to the counter field of the Error Pin PWM Low Counter Value Register whenever the error output pin toggles low. This field is only reset by a Power-On-Reset (not warm reset).  A global soft reset will set this field to 24'h0186A0." range="23:0" rwaccess="R/W"/>
	</register><register id="ESM_PCR_GENERATED_MEMORY_MAP_ERR_GRP_RAW_j" acronym="ESM_PCR_GENERATED_MEMORY_MAP_ERR_GRP_RAW_j" offset="1024" width="32" description="Raw Status/Set Register for Group A Errors">
		<bitfield id="STS" width="32" begin="31" end="0" resetval="0x0" description="This is the raw status of the events in group N. Each bit corresponds to event Q where Q = N*32+Bit (Example: bit 0 is event N*32+0, bit 1 is N*32 + 1 etc).  For Level events, the raw status is the event input synchronized to the ESM clock and stored in a multi-bit (for redundancy) internal register.  For Pulse events, the raw status is multi-bit (for redundancy) internal register that is set when two of the three edge detection circuits on the redundant event capture a rising edge.  This field is only reset by a Power-On-Reset (not warm reset). A global soft reset will set this field to 0.  Read:  1'b0: Inactive  1'b1: Active/Pending  Write 1'b1 to set interrupt raw status" range="31:0" rwaccess="R/W1TS"/>
	</register><register id="ESM_PCR_GENERATED_MEMORY_MAP_ERR_GRP_STS_j" acronym="ESM_PCR_GENERATED_MEMORY_MAP_ERR_GRP_STS_j" offset="1028" width="32" description="Error Enable and Clear Register">
		<bitfield id="MSK" width="32" begin="31" end="0" resetval="0x0" description="This is the masked status of the events in group N.  Each bit corresponds to event Q where Q = N*32+Bit (Example: bit 0 is event N*32+0, bit 1 is N*32 + 1 etc...).  This field is only reset by a Power-On-Reset (not warm reset).  A global soft reset will set this field to 0.  Read:  1'b0: Inactive  1'b1: Active/Pending  Write 1'b1 to clear interrupt raw status" range="31:0" rwaccess="R/W1TC"/>
	</register><register id="ESM_PCR_GENERATED_MEMORY_MAP_ERR_GRP_INTR_EN_SET_j" acronym="ESM_PCR_GENERATED_MEMORY_MAP_ERR_GRP_INTR_EN_SET_j" offset="1032" width="32" description="Level Error Enable Set Register">
		<bitfield id="MSK" width="32" begin="31" end="0" resetval="0x0" description="This field is used to enable the mask of events in group N.  Each bit corresponds to event Q where Q = N*32+Bit.  If the corresponding bit and the global_enable are set, then then interrupt is unmasked.   This field is only reset by a Power-On-Reset (not warm reset).  A global soft reset will set this field to 0.  Read:  1'b0: Disabled  1'b1: Enabled  Write 1'b1 to set enable" range="31:0" rwaccess="R/W1TS"/>
	</register><register id="ESM_PCR_GENERATED_MEMORY_MAP_ERR_GRP_INTR_EN_CLR_j" acronym="ESM_PCR_GENERATED_MEMORY_MAP_ERR_GRP_INTR_EN_CLR_j" offset="1036" width="32" description="Level Error Interrupt Enabled Clear register">
		<bitfield id="MSK" width="32" begin="31" end="0" resetval="0x0" description="This field is used to disable the mask of events in group N.  Each bit corresponds to event Q where Q = N*32+Bit.  If the corresponding bit and the global_enable are set, then then interrupt is unmasked.  This field is only reset by a Power-On-Reset (not warm reset).  A global soft reset will set this field to 0.  Read:  1'b0: Disabled  1'b1: Enabled  Write 1'b1 to clear enable" range="31:0" rwaccess="R/W1TC"/>
	</register><register id="ESM_PCR_GENERATED_MEMORY_MAP_ERR_GRP_INT_PRIO_j" acronym="ESM_PCR_GENERATED_MEMORY_MAP_ERR_GRP_INT_PRIO_j" offset="1040" width="32" description="Level Error Interrupt Enabled Clear register">
		<bitfield id="MSK" width="32" begin="31" end="0" resetval="0x0" description="This field is used to indicate which interrupt the corresponding event influences (if enabled) for event group N.  Each bit corresponds to event Q where Q = N*32+Bit.  This field is only reset by a Power-On-Reset (not warm reset).  A global soft reset will set this field to 0.  0 - Low Priority Interrupt  1 - High Priority Interrupt" range="31:0" rwaccess="R/W"/>
	</register><register id="ESM_PCR_GENERATED_MEMORY_MAP_ERR_GRP_PIN_EN_SET_j" acronym="ESM_PCR_GENERATED_MEMORY_MAP_ERR_GRP_PIN_EN_SET_j" offset="1044" width="32" description="Level Error Interrupt Enabled Clear register">
		<bitfield id="MSK" width="32" begin="31" end="0" resetval="0x0" description="This field is used to enable the mask of events in group N.  Each bit corresponds to event Q where Q = N*32+Bit.  This field is only reset by a Power-On-Reset (not warm reset).  A global soft reset will set this field to 0.  Read:  1'b0: Disabled  1'b1: Enabled  Write 1'b1 to set enable" range="31:0" rwaccess="R/W1TS"/>
	</register><register id="ESM_PCR_GENERATED_MEMORY_MAP_ERR_GRP_PIN_EN_CLR_j" acronym="ESM_PCR_GENERATED_MEMORY_MAP_ERR_GRP_PIN_EN_CLR_j" offset="1048" width="32" description="Level Error Interrupt Enabled Clear register">
		<bitfield id="MSK" width="32" begin="31" end="0" resetval="0x0" description="This field is used to enable the mask of events in group N.  Each bit corresponds to event Q where Q = N*32+Bit.  This field is only reset by a Power-On-Reset (not warm reset).  A global soft reset will set this field to 0.  Read:  1'b0: Disabled  1'b1: Enabled  Write 1'b1 to clear enable" range="31:0" rwaccess="R/W1TC"/>
	</register>
</module>